In [ ]:
## Import the required libraries

In [ ]:
## Read that data into Python and call the dataframe churnData

In [1]:
import pandas as pd
from sklearn.datasets import load_boston
from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeRegressor

In [10]:
churndata = pd.read_csv('Customer-Churn.csv')

In [11]:
churndata.head()

,gender,SeniorCitizen,Partner,Dependents,tenure,PhoneService,OnlineSecurity,OnlineBackup,DeviceProtection,TechSupport,StreamingTV,StreamingMovies,Contract,MonthlyCharges,TotalCharges,Churn
0,Female,0,Yes,No,1,No,No,Yes,No,No,No,No,Month-to-month,29.85,29.85,No
1,Male,0,No,No,34,Yes,Yes,No,Yes,No,No,No,One year,56.95,1889.5,No
2,Male,0,No,No,2,Yes,Yes,Yes,No,No,No,No,Month-to-month,53.85,108.15,Yes
3,Male,0,No,No,45,No,Yes,No,Yes,Yes,No,No,One year,42.30,1840.75,No
4,Female,0,No,No,2,Yes,No,No,No,No,No,No,Month-to-month,70.70,151.65,Yes

#### Convert this column into numeric type using pd.to_numeric function.

In [12]:
churndata.dtypes

gender               object
SeniorCitizen         int64
Partner              object
Dependents           object
tenure                int64
PhoneService         object
OnlineSecurity       object
OnlineBackup         object
DeviceProtection     object
TechSupport          object
StreamingTV          object
StreamingMovies      object
Contract             object
MonthlyCharges      float64
TotalCharges         object
Churn                object
dtype: object

In [15]:
churndata[['TotalCharges']] = churndata[['TotalCharges']].apply(pd.to_numeric, errors='coerce')
churndata[['TotalCharges']]

      TotalCharges
0            29.85
1          1889.50
2           108.15
3          1840.75
4           151.65
...            ...
7038       1990.50
7039       7362.90
7040        346.45
7041        306.60
7042       6844.50

[7043 rows x 1 columns]

In [17]:
churndata['TotalCharges'].dtypes

dtype('float64')

#### Check for null values in the dataframe. Replace the null values.

In [18]:
churndata.isna().sum()

gender               0
SeniorCitizen        0
Partner              0
Dependents           0
tenure               0
PhoneService         0
OnlineSecurity       0
OnlineBackup         0
DeviceProtection     0
TechSupport          0
StreamingTV          0
StreamingMovies      0
Contract             0
MonthlyCharges       0
TotalCharges        11
Churn                0
dtype: int64

In [19]:
def replace(churndata, columns):
    for col in columns:
        mean_value = churndata[columns].mean()
        churndata[columns] = churndata[columns].fillna(mean_value)  #fill with mean
    return churndata

In [22]:
replace(churndata, ['TotalCharges'])

,gender,SeniorCitizen,Partner,Dependents,tenure,PhoneService,OnlineSecurity,OnlineBackup,DeviceProtection,TechSupport,StreamingTV,StreamingMovies,Contract,MonthlyCharges,TotalCharges,Churn
0,Female,0,Yes,No,1,No,No,Yes,No,No,No,No,Month-to-month,29.85,29.85,No
1,Male,0,No,No,34,Yes,Yes,No,Yes,No,No,No,One year,56.95,1889.50,No
2,Male,0,No,No,2,Yes,Yes,Yes,No,No,No,No,Month-to-month,53.85,108.15,Yes
3,Male,0,No,No,45,No,Yes,No,Yes,Yes,No,No,One year,42.30,1840.75,No
4,Female,0,No,No,2,Yes,No,No,No,No,No,No,Month-to-month,70.70,151.65,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,Male,0,Yes,Yes,24,Yes,Yes,No,Yes,Yes,Yes,Yes,One year,84.80,1990.50,No
7039,Female,0,Yes,Yes,72,Yes,No,Yes,Yes,No,Yes,Yes,One year,103.20,7362.90,No
7040,Female,0,Yes,Yes,11,No,Yes,No,No,No,No,No,Month-to-month,29.60,346.45,No
7041,Male,1,Yes,No,4,Yes,No,No,No,No,No,No,Month-to-month,74.40,306.60,Yes
7042,Male,0,No,No,66,Yes,Yes,No,Yes,Yes,Yes,Yes,Two year,105.65,6844.50,No

## Use the following features: tenure, SeniorCitizen, MonthlyCharges and TotalCharges

### Scale the features either by using normalizer or a standard scaler.
### Split the data into a training set and a test set.
### Fit a logistic regression model on the training data.
### Check the accuracy on the test data.

In [24]:
features = churndata[['tenure', 'SeniorCitizen', 'MonthlyCharges', 'TotalCharges', 'Churn']]
features

      tenure  SeniorCitizen  MonthlyCharges  TotalCharges Churn
0          1              0           29.85         29.85    No
1         34              0           56.95       1889.50    No
2          2              0           53.85        108.15   Yes
3         45              0           42.30       1840.75    No
4          2              0           70.70        151.65   Yes
...      ...            ...             ...           ...   ...
7038      24              0           84.80       1990.50    No
7039      72              0          103.20       7362.90    No
7040      11              0           29.60        346.45    No
7041       4              1           74.40        306.60   Yes
7042      66              0          105.65       6844.50    No

[7043 rows x 5 columns]

In [26]:
#train-test split
X = features.drop('Churn', axis =1)
y_features = features['Churn']
y = y_features.apply(lambda x: 1 if x=='Yes' else 0)

In [27]:
y

0       0
1       0
2       1
3       0
4       1
       ..
7038    0
7039    0
7040    0
7041    1
7042    0
Name: Churn, Length: 7043, dtype: int64

In [28]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.25, random_state=25)

In [29]:
y_test.shape

(1761,)

In [30]:
y_test

4864    0
5033    0
2671    0
3919    1
3630    1
       ..
5145    0
5302    0
7027    0
3402    1
6108    0
Name: Churn, Length: 1761, dtype: int64

In [31]:
#X_train_num = X_train.select_dtypes(np.number)
#X_test_num = X_test.select_dtypes(np.number)

#### Scale

In [33]:
from sklearn.preprocessing import StandardScaler
transformer = StandardScaler().fit(X_train)
x_train_stand = transformer.transform(X_train)

In [34]:
import pickle
with open('numerical_train.pickle', 'wb') as file:
    pickle.dump(transformer, file)

#### Load pickle

In [35]:
with open('numerical_train.pickle', 'rb') as file:
    unpickled_transformer = pickle.load(file)

In [36]:
X_train_n = unpickled_transformer.transform(X_train)

#### Scale again

In [37]:
transformer = StandardScaler().fit(X_test)
X_test_n = transformer.transform(X_test)

In [38]:
X_train_n.shape, X_test_n.shape

((5282, 4), (1761, 4))

## Fit a logistic regression model on the training data

In [40]:
from sklearn.linear_model import LogisticRegression
classification_model = LogisticRegression(random_state=42, max_iter=1942)
classification_model.fit(X, y)

LogisticRegression(max_iter=1942, random_state=42)

#### Accuracy

In [41]:
classification_model.score(X_test, y_test)

0.7898921067575241

#### Imbalance

In [44]:
churndata['Churn'].value_counts()

No     5174
Yes    1869
Name: Churn, dtype: int64

### Downsampling

In [46]:
category_0_down = features[features['Churn'] == 'No']
category_1_down = features[features['Churn'] == 'Yes']

In [47]:
category_0_down = category_0_down.sample(len(category_1_down), replace = True)

In [48]:
print('Cat_0_down, Cat_1_down')
print(category_0_down.shape, category_1_down.shape)

Cat_0_down, Cat_1_down
(1869, 5) (1869, 5)

#### Check downsampling accuracy

In [50]:
downsample_df = pd.concat([category_0_down, category_1_down])
downsample_df

      tenure  SeniorCitizen  MonthlyCharges  TotalCharges Churn
3754       1              0           20.05     20.050000    No
2221      71              0           64.05   4492.900000    No
3826       0              0           25.35   2283.300441    No
2968       3              0           90.40    268.450000    No
815       25              0           84.60   2088.050000    No
...      ...            ...             ...           ...   ...
7021      12              0           59.80    727.800000   Yes
7026       9              0           44.20    403.350000   Yes
7032       1              1           75.75     75.750000   Yes
7034      67              0          102.95   6886.250000   Yes
7041       4              1           74.40    306.600000   Yes

[3738 rows x 5 columns]

In [51]:
X_down = downsample_df.drop('Churn', axis = 1)
y_down = downsample_df['Churn']

In [52]:
X_train, X_test, y_train, y_test = train_test_split(X_down, y_down, test_size=0.25, random_state=1942)

In [53]:
classification_model_downsample = LogisticRegression(random_state=42, max_iter=1942)
classification_model_downsample.fit(X_down, y_down)

LogisticRegression(max_iter=1942, random_state=42)

In [54]:
classification_model_downsample.score(X_test, y_test)

0.7679144385026738

In [55]:
y_test

6927     No
1071    Yes
6486    Yes
3703     No
1963     No
       ...
3030    Yes
7034    Yes
5237     No
185     Yes
1264     No
Name: Churn, Length: 935, dtype: object

### Upsampling

In [56]:
category_0_up = features[features['Churn'] == 'No']
category_1_up = features[features['Churn'] == 'Yes']

In [57]:
category_1_up = category_1_up.sample(len(category_0_up), replace=True)

In [58]:
print('Cat_0_up, Cat_1_up')
print(category_0_up.shape, category_1_up.shape)

Cat_0_up, Cat_1_up
(5174, 5) (5174, 5)

#### Check upsampling accuracy

In [59]:
upsample_df = pd.concat([category_0_up, category_1_up])
upsample_df

      tenure  SeniorCitizen  MonthlyCharges  TotalCharges Churn
0          1              0           29.85         29.85    No
1         34              0           56.95       1889.50    No
3         45              0           42.30       1840.75    No
6         22              0           89.10       1949.40    No
7         10              0           29.75        301.90    No
...      ...            ...             ...           ...   ...
629       49              1           90.05       4547.25   Yes
5738       1              0           20.60         20.60   Yes
1883      35              1          100.50       3653.35   Yes
4856      31              0           91.15       2995.45   Yes
2214      14              0           86.30       1180.95   Yes

[10348 rows x 5 columns]

In [60]:
X_up = upsample_df.drop('Churn', axis = 1)
y_up = upsample_df['Churn']

In [61]:
X_train, X_test, y_train, y_test = train_test_split(X_up, y_up, test_size=0.2, random_state=1942)

In [62]:
classification_model_upsample = LogisticRegression(random_state=42, max_iter=1942)
classification_model_upsample.fit(X_up, y_up)

LogisticRegression(max_iter=1942, random_state=42)

In [63]:
classification_model_upsample.score(X_test, y_test)

0.7425120772946859

In [64]:
y_test

941      No
4978    Yes
4098    Yes
4812    Yes
2148     No
       ...
5270    Yes
585     Yes
3517    Yes
1139     No
4981    Yes
Name: Churn, Length: 2070, dtype: object